[
    {
        "uid": "1",
        "type": "text",
        "verify": "Document Name",
        "hint": "RA001",
        "articles": [
            {
                "id": "1",
                "article": "Introduction and scope",
                "uuid": "9743f31c-ec13-16fa-b99c-2409c32b346e",
                "variables": [
                    {
                        "uuid": "e6bf136b-a3c9-1895-8d98-8a319b708333",
                        "subarticle": "1.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "8dba4b09-cce7-15f7-b6ea-11c68da73947",
                        "subarticle": "1.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "aa0c41dd-78db-13d1-be5c-0e0366ee0640",
                        "subarticle": "1.4",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "bfd09dba-8e81-16d2-9855-446febf49971",
                        "subarticle": "1.6",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "608f9b7f-7594-1e7e-99bd-1af6656e7712",
                        "subarticle": "1.8",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "b11698e7-16b9-1fcf-ae98-53c14bb9fa4e",
                        "subarticle": "1.8",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "1.1",
                        "uuid": "9ff284ae-908a-1e80-8831-90a4cef427a5",
                        "type": "custmText",
                        "similarity": 0.7380952380952381,
                        "content": "This a unilateral agreement for International Roaming for the provision by Proximus of Direct Wholesale Roaming Access Services, in order to enable Roaming Customers of Operator to gain access to mobile telecommunications services in the geographic areas where Proximus operates as a VPMN. This agreement is for Direct Roaming Wholesale Access (“agreement”), as defined below.  "
                    },
                    {
                        "id": "1.2",
                        "uuid": "bdbdac41-4cdf-190b-bd3f-8d4b4bea7e04",
                        "type": "newText",
                        "similarity": 0.13414634146341464,
                        "content": "The Operator is either (i) a MNO constituting a Roaming Provider or (ii) a full MVNO which operates as an MNO in relation to international roaming and which equally constitutes a Roaming Provider.  This reference offer is intended for EU/EEA MNO’s and full MVNO’s having obtained a License and/or Authorization for offering mobile services by the authorities in their EU/EEA country of origin, excluding Belgium."
                    },
                    {
                        "id": "1.3",
                        "uuid": "83732a00-0ebf-12aa-bab2-89a4c59c14ab",
                        "type": "custmText",
                        "similarity": 0.3333333333333333,
                        "content": "This Direct Wholesale Roaming Access Agreement contains the basic principles applicable to the Services provided by Proximus to Operator."
                    },
                    {
                        "id": "1.4",
                        "uuid": "07a1a24b-33b3-1968-b9c2-61f640ae2e28",
                        "type": "newText",
                        "similarity": 0.06666666666666667,
                        "content": "The Services and the technical terms and conditions offered by Proximus to Operator shall not differ substantially from those provided by Proximus to other Operators who request a similar service upon similar technical, qualitative and pricing conditions, however subject to technical availability. Without prejudice to the foregoing, the Parties may alternatively directly amend the terms and conditions of this Agreement, or otherwise include deviations.  "
                    },
                    {
                        "id": "1.5",
                        "uuid": "605412b5-ef8d-1b6e-bee3-f6e67da6f082",
                        "type": "newText",
                        "similarity": 0.16,
                        "content": "The Annexes, including the Overview of the Annex Structure, constitute an integral part of the Agreement. In case of discrepancy between different parts of the Agreement the following order of interpretation shall be applied:  1. the main body of this Agreement; and  2. the Annexes "
                    },
                    {
                        "id": "1.6",
                        "uuid": "81805e95-4b6e-1d32-bce9-4768938d9131",
                        "type": "newText",
                        "similarity": 0.05172413793103448,
                        "content": "In case of additional requirements, exceptions and/or contradictions between the Agreement and any Technical Specifications or GSM Association Permanent Reference Documents, the provisions of the Agreement shall prevail."
                    },
                    {
                        "id": "1.7",
                        "uuid": "7ed277db-44db-1ed8-98f8-fb101b2f73ab",
                        "type": "newText",
                        "similarity": 0.10204081632653061,
                        "content": "Subject to applicable laws, the Parties agree to be bound by GSMA Permanent Reference documents relevant to International Roaming for example but not limited to: 1. GSMA PRDs related to Quality of Service; 2. GSMA PRDs related to Fraud Detection; and 3. GSMA PRDs relating to Billing between the parties including Invoicing, Settlement and dispute resolution."
                    },
                    {
                        "id": "1.8",
                        "uuid": "bf955807-3204-1340-bc2e-69d2b0087905",
                        "type": "newText",
                        "similarity": 0.13953488372093023,
                        "content": "he conclusion of the Agreement is subject to the respect of the procedure for access requests, as described on Proximus website.  Moreover, as a condition precedent for the signature of the present Agreement, such Agreement may not be signed (or renewed) if during the 12 months preceding the envisaged Date of signature/renewal, the Operator has been subject to a notice of termination sent by Proximus in the context of Direct Wholesale Roaming Access services or to penalties for abusive use of the then ongoing Wholesale Roaming Access Agreement. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions   "
                    }
                ]
            },
            {
                "id": "2",
                "article": "Starting Date",
                "uuid": "41da7c4d-ff32-1a52-89b7-49f27bfb8683",
                "variables": [],
                "subarticles": [
                    {
                        "id": "2.1",
                        "uuid": "69cd2ae8-da6b-1297-9b4c-9575caf23ac6",
                        "type": "custmText",
                        "similarity": 0.7428571428571429,
                        "content": "The actual commercial starting Date for International Roaming shall be the Date as agreed by both Parties in written form after successful completion of all necessary network and billing test procedures.  "
                    }
                ]
            },
            {
                "id": "3",
                "article": "Definitions",
                "uuid": "115500d1-e48e-1d19-9482-be7a9ef909e9",
                "variables": [
                    {
                        "uuid": "7fcc9457-6842-123d-bb7d-c6b24115f8ca",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "c00d01ce-78ac-145d-897c-e2610bcce4fa",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "e333b23d-172e-1ecf-8bb2-16b170d9b3bf",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "51c30fd1-0d97-18f5-811d-2696ad64de1e",
                        "subarticle": "3.9",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "bdb31500-22a7-16b1-9422-29b743239c7f",
                        "subarticle": "3.9",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "2d2fdc00-1b21-1182-86ce-5012e83da2dc",
                        "subarticle": "3.12",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "3.1",
                        "uuid": "c7ea55d4-e2cc-1100-961c-62fe5ae47574",
                        "type": "custmText",
                        "similarity": 0.7142857142857143,
                        "content": " \"Affiliated Company\" of a Party means any other legal entity: 1. directly or indirectly owning or controlling the Party, or 2. under the direct or indirect ownership or control of the same legal entity directly or indirectly owning or controlling the Party, or 3. directly or indirectly owned or controlled by the Party, for so long as such ownership or control lasts.  Ownership or control shall exist through the direct or indirect ownership of more than 50 % of the nominal value of the issued equity share capital or of more than 50 % of the shares entitling the holders to vote for the election of directors or persons performing similar functions."
                    },
                    {
                        "id": "3.2",
                        "uuid": "8ea3e706-a680-1722-b28b-f674ff65c179",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.3",
                        "uuid": "2cb55636-563b-1419-b203-138d3c2587ff",
                        "type": "custmText",
                        "similarity": 0.5483870967741935,
                        "content": "\"Agreement\" shall mean this Direct Wholesale Roaming Access Agreement together with the Annexes attached hereto. \"Date of the Agreement\" shall mean the Date as of which both Parties have signed the Agreement by their duly authorized representatives."
                    },
                    {
                        "id": "3.4",
                        "uuid": "b8230d05-fe09-1745-a22e-27ab2fa55fd0",
                        "type": "newText",
                        "similarity": 0.11764705882352941,
                        "content": "Direct Wholesale Roaming Access shall have the meaning as defined in Article 2 (2) (p) of the Roaming Regulation, with the exception of wholesale roaming resale access as defined in Article 2 (2) (q) of the Roaming Regulation."
                    },
                    {
                        "id": "3.5",
                        "uuid": "b8f11fe0-bb84-1a3a-8d47-a2d672680465",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.6",
                        "uuid": "356a1d49-46a4-11de-81b0-58d44486a539",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.7",
                        "uuid": "1ff2b850-6001-1df5-a07e-63810b176c15",
                        "type": "newText",
                        "similarity": 0.11428571428571428,
                        "content": "\"GSM Association General Assembly\" shall mean that body of the GSM Association formed by the Members and Associate Members. \"GSM Association Permanent Reference Documents\" means a document noted as such by the PSMC to the General Assembly and listed as such by Headquarters on the list of Permanent Reference Documents. “International Roaming” or “IR” shall mean the provision of Services by Proximus in respect of which access is granted by Roaming Customers of Operator through Proximus’ s PMN. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "3.8",
                        "uuid": "f7886820-b774-1c6b-96ad-1f272463dab4",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.9",
                        "uuid": "f9841ed7-9a57-187b-b4e3-c6e8cda6fe96",
                        "type": "newText",
                        "similarity": 0.07692307692307693,
                        "content": "\"Public Mobile Network“ or \"PMN\" shall mean a network that complies with the definition of a GSM network as set out in the Articles of Association of the GSM Association (AA.16).1  \"Roaming Customer\" shall have the meaning as defined in Article 2 (2) (g) of the Roaming Regulation and shall in practice mean a person or entity with a valid legal relationship with Operator using a GSM SIM (Subscriber Identity Module) and/or a GSM USIM (Universal Subscriber Identity Module) for use by that person or entity of the Services while roaming on Proximus’s PMN in accordance with this Agreement. terms and conditions of the "
                    },
                    {
                        "id": "3.10",
                        "uuid": "404b85d1-8688-107c-957f-d35709aefef3",
                        "type": "newText",
                        "similarity": 0.08,
                        "content": " Roaming Provider shall have the meaning as defined in Article 2 (2) (a) of the Roaming Regulation."
                    },
                    {
                        "id": "3.11",
                        "uuid": "c373ecd3-602b-169f-9e43-f0f9b84803bc",
                        "type": "newText",
                        "similarity": 0.06818181818181818,
                        "content": " Roaming Regulation shall mean the Regulation (EU) No. 2015/2120 of the European Parliament and of the Council of 25 November 2015 amending Regulation (EU) No 531/2012 on roaming on public mobile communications networks within the Union, O.J., L 310/1 of 26 November 2015."
                    },
                    {
                        "id": "3.12",
                        "uuid": "77dca38c-800d-1414-9e9d-0b34f071b80a",
                        "type": "newText",
                        "similarity": 0.1111111111111111,
                        "content": " \"Services\" shall mean the services of Direct Wholesale Roaming Access provided under this Agreement, as specified in Annexes 2 and 10, as the same may be amended from time to time by Proximus."
                    },
                    {
                        "id": "3.13",
                        "uuid": "becabde2-bacb-1f03-a864-89bd26415af7",
                        "type": "newText",
                        "similarity": 0.03225806451612903,
                        "content": " “Session” shall mean the time between PDP Context Activation until PDP Context deactivation."
                    }
                ]
            },
            {
                "id": "4",
                "article": "Annexes",
                "uuid": "870288fc-8766-1f1d-8fcc-432b18649b85",
                "variables": [],
                "subarticles": [
                    {
                        "id": "4.1",
                        "uuid": "c37def81-6547-175c-9105-f44be2ace8a8",
                        "type": "stdClause",
                        "similarity": 1.0,
                        "content": " The Annexes are divided as set out in the Overview of the Annex Structure.       "
                    }
                ]
            },
            {
                "id": "5",
                "article": "Technical Framework",
                "uuid": "229c98f4-d180-1176-a913-ccebb54a62a0",
                "variables": [
                    {
                        "uuid": "05a0f1cf-2562-1b20-99a7-94988ec42cc5",
                        "subarticle": "5.2",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "5.1",
                        "uuid": "9d38fc1b-30c4-1001-afc7-3cddf76c4c96",
                        "type": "newText",
                        "similarity": 0.2638888888888889,
                        "content": "In respect of and subject to their licenses or rights and other national binding regulations to establish and operate Public Mobile Networks, the Parties to the Agreement agree, subject to Article "
                    },
                    {
                        "id": "5.2",
                        "uuid": "d042ff71-92e1-1dba-a165-0cea5696d85c",
                        "type": "custmText",
                        "similarity": 0.3508771929824561,
                        "content": "to establish IR in accordance with: 1. relevant Technical Specifications;  2. all binding GSM Association Permanent Reference Documents; and  3. those non-binding GSM Association Permanent Reference Documents which are agreed by the Parties and specifically set out in the Annexes; including in each case all the commercial aspects, as defined in the Agreement, including the Annexes hereto. 5.2. Additional requirements and exceptions to the Technical Specifications and GSM Association Permanent Reference Documents, as agreed between the Parties, are detailed in the Agreement and/or Annexes to the Agreement.   "
                    }
                ]
            },
            {
                "id": "6",
                "article": "Management of Modifications to the Services",
                "uuid": "aede5ed9-9bca-1ac8-a951-dd00042dbab2",
                "variables": [
                    {
                        "uuid": "a2aea036-1654-1d0f-84ed-68cadd1975e8",
                        "subarticle": "6.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "63e6c314-f971-1560-925c-7c4f75ef8fac",
                        "subarticle": "6.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "f605d2f3-14e8-1130-88a5-18f3d98713ab",
                        "subarticle": "6.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "ca6a003f-976f-1924-93c4-b9dad16368a2",
                        "subarticle": "6.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "6.1",
                        "uuid": "2d5cbef2-b3cf-1639-b688-6d88ad2a8ad0",
                        "type": "custmText",
                        "similarity": 0.6049382716049383,
                        "content": "Following notice of change served by Proximus to implement new Services or changes to any existing Services in accordance with Article 19.2, section 2 both Parties shall discuss the impact of any such change for Roaming Customers (including Roaming Customers’ access to these Services) and in relation to:  1. network and billing test procedures as set out in the Technical Specifications and the GSM Association Permanent Reference Documents, as requested by either Party;  2. administrative activities; and 3. the targeted starting Date for the changed services."
                    },
                    {
                        "id": "6.2",
                        "uuid": "75281aba-aed8-1703-b7d5-4bbe1153d875",
                        "type": "newText",
                        "similarity": 0,
                        "content": "he Roaming provider is entitled to ask the Direct Wholesale Operator, prior to the launch, a forecast of all voice, SMS and data traffic for the coming 12 months after commercial launch. These forecasts will enable Proximus to make the Services available in the best possible conditions. Consequently, such forecasts shall be based on reliable data and Operator undertakes to upDate them at the end of each calendar semester starting from the semester following the commercial starting Date, by consistently maintaining a 12-month anticipation. In case of inaccurate forecasts, Proximus will not be liable for any default in the provision of the Services.  This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    }
                ]
            },
            {
                "id": "7",
                "article": "Charging, Billing & Accounting",
                "uuid": "4a64749a-162c-1ea3-86f8-f23be9de62e8",
                "variables": [
                    {
                        "uuid": "40499249-e60e-100b-ab4d-fb609632a9f8",
                        "subarticle": "7.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "7.1",
                        "uuid": "491be861-5517-1d55-8eed-e974fe3764e3",
                        "type": "newText",
                        "similarity": 0.07017543859649122,
                        "content": "When a Roaming Customer uses the Services made available hereunder by Proximus, Operator shall be responsible for payment of charges for the said Services so used in accordance with the tariff of Proximus.  "
                    },
                    {
                        "id": "7.2",
                        "uuid": "0720ed13-fb93-1561-b747-fd8171306164",
                        "type": "newText",
                        "similarity": 0.09090909090909091,
                        "content": "he Roaming provider is entitled to ask the Wholesale Operator, prior to the commercial launch, to provide a bank guarantee based on the traffic forecast for the coming twelve months. If traffic volumes change the roaming provider may request the bank guarantee to be changed accordingly.    "
                    }
                ]
            },
            {
                "id": "8",
                "article": "Implementation of TAP",
                "uuid": "e1c0b5fc-43a7-14b0-8a3a-75e3dfcecb26",
                "variables": [
                    {
                        "uuid": "fda5ac2b-02a1-13ba-ab59-5e4fa72625f4",
                        "subarticle": "8.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "8.1",
                        "uuid": "663f3483-a98c-1511-83cd-efdedbba6c85",
                        "type": "stdClause",
                        "similarity": 0.8571428571428571,
                        "content": "The Parties shall implement TAP according to the GSM Association Permanent Reference Documents and the provisions set out in the Annex 3.1.  "
                    }
                ]
            },
            {
                "id": "9",
                "article": "Billing and Accounting",
                "uuid": "1c64317c-b387-138e-9947-e122a3fb8f08",
                "variables": [],
                "subarticles": [
                    {
                        "id": "9.1",
                        "uuid": "538c1532-26e0-197d-8e97-75b75fc027db",
                        "type": "custmText",
                        "similarity": 0.75,
                        "content": "The Parties shall implement billing and accounting according to the GSM Association Permanent Reference Documents and the provisions set out in Annex 3.  1"
                    }
                ]
            },
            {
                "id": "10",
                "article": "Customer Care",
                "uuid": "37520720-67fa-1077-ad4b-86d4a9573ff7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "10.1",
                        "uuid": "f07fe540-4d0e-1c4a-9fe5-300937fb9bed",
                        "type": "custmText",
                        "similarity": 0.7333333333333333,
                        "content": "The responsibilities of each Party concerning Customer Care are described in Annex 4.  1"
                    }
                ]
            },
            {
                "id": "11",
                "article": "Confidentiality",
                "uuid": "f4de4338-4c67-1227-be98-5c0cbed080c9",
                "variables": [
                    {
                        "uuid": "f0e32ecf-6755-10b0-8e03-8d12d505a9b1",
                        "subarticle": "11.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "cb088108-f110-1432-a361-6cc9b8000e1b",
                        "subarticle": "11.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "11.1",
                        "uuid": "09e47bbc-b1a5-10ab-b836-df265bbba3ee",
                        "type": "custmText",
                        "similarity": 0.775,
                        "content": "The Parties agree that all aspects of the contents of the Agreement shall be treated as Information (as defined below) and no information in respect to the content of the Agreement shall be disclosed without the prior written consent of the Parties except as reasonably necessary to implement the Agreement  them referred (hereinafter "
                    },
                    {
                        "id": "11.2",
                        "uuid": "791fd312-5139-1f78-a66a-fdd4afd1cde5",
                        "type": "custmText",
                        "similarity": 0.5728643216080402,
                        "content": "In addition to Article 11.1 hereof, the Parties hereby agree to treat all information exchanged between to as \"Information\") as confidential and agree not to disclose such Information in any manner whatsoever, in whole or in part except as provided in this Article 11. The Parties shall not use any Information other than in connection with the discussions between them and any transactions resulting therefrom, or for the provision of the Services as contemplated herein. The Parties are also entitled to disclose Information to third parties in the context of a possible bona fide acquisition or sale of its operations in support of reasonably related due diligence activities in respect thereof, or for the borrowing of funds or obtaining of insurance, in which case any third parties (including lenders or insurance companies) involved in such activities shall be  obliged to enter into confidentiality agreements which have the equivalent content as this Article 11 before receiving the Information. In addition to the foregoing, the Parties shall also be entitled to share information with Affiliated Companies, directors, This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions agents, professional advisers, contractors, employees or resellers on a need to know basis provided that such Affiliated Companies, agents, contractors, employees or resellers have entered into confidentiality agreements in a form substantially equivalent to and on terms and conditions no less stringent than the terms and conditions set out in this Article 11. Subject to Article "
                    },
                    {
                        "id": "11.3",
                        "uuid": "68651b87-c765-1f28-bc2c-2c7277b49d91",
                        "type": "custmText",
                        "similarity": 0.6111111111111112,
                        "content": "each Party shall be liable in accordance with Article 14 (subject to Article 11.3) towards the other Party in respect of any unauthorized disclosure of Information made by any other authorized recipients.  11.3. Notwithstanding Article 14, each Party shall be liable under this Agreement to the other Party in respect of any proven damage or loss to the other Party caused by its unauthorised use or disclosure of such information only up to the sum of five hundred thousand (500,000) SDR.  "
                    },
                    {
                        "id": "11.4",
                        "uuid": "15b5bb61-7285-1123-a02c-5c9a49ba13aa",
                        "type": "custmText",
                        "similarity": 0.7857142857142857,
                        "content": "Notwithstanding Article 11.1 above, Information and the contents of this Agreement may be transmitted to governmental, judicial or regulatory authorities, as may be required by any governmental, judicial or regulatory authority."
                    },
                    {
                        "id": "11.5",
                        "uuid": "0a637b0f-a4df-164f-a375-d384e6b326f3",
                        "type": "custmText",
                        "similarity": 0.6521739130434783,
                        "content": " For the purposes of the Agreement, Information and the contents of this Agreement shall not be considered to be confidential if such Information is: 1. in or passed into the public domain other than by breach of this Article; or 2. known to a receiving Party prior to the disclosure by a disclosing Party; or 3. disclosed to a receiving Party without restriction by a third party having 4. the full right to disclose; or independently developed by a receiving Party to whom no disclosure of confidential Information relevant to such Information has been made."
                    },
                    {
                        "id": "11.6",
                        "uuid": "26e12ab0-3a32-1a41-967b-d9db23aba56a",
                        "type": "stdClause",
                        "similarity": 0.803030303030303,
                        "content": "Each Party agrees that in the event of a breach or threatened breach of Article 11, the harm suffered by the other Party would not be compensable by monetary damages alone and, accordingly, in addition to other available legal or equitable remedies, the other Party shall be entitled to apply for an injunction or specific performance with respect to such breach or threatened breach, without proof of actual damages (and without the requirement of posting a bond or other security) and each Party agrees not to plead sufficiency of damages as a defence.  "
                    },
                    {
                        "id": "11.7",
                        "uuid": "ba9a637d-1895-1dd7-abdf-7f224ee6925c",
                        "type": "custmText",
                        "similarity": 0.7272727272727273,
                        "content": "Article 11 shall survive the termination of the Agreement for a period of ten (10) years but shall not in any way limit or restrict a disclosing Party's use of its own confidential Information.  1"
                    }
                ]
            },
            {
                "id": "12",
                "article": "Data Privacy",
                "uuid": "cb409a1b-0ddc-106d-89ab-58a89e66f931",
                "variables": [
                    {
                        "uuid": "e9a42657-c7cf-149f-aadb-3347c1d29fb8",
                        "subarticle": "12.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "d5edb48e-4012-1329-ad54-744d8dc3ad9f",
                        "subarticle": "12.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "12.1",
                        "uuid": "8df65075-65c4-1d2f-b6cb-70cad7e7178e",
                        "type": "stdClause",
                        "similarity": 0.8333333333333334,
                        "content": "Each Party’s obligations hereunder to transfer information to the other Party shall not apply to the extent that a Party is prohibited from doing so by the regulations and laws of its own country applicable to IR and/or data protection.  "
                    },
                    {
                        "id": "12.2",
                        "uuid": "d46129cf-5355-1d4a-ba68-ade229970570",
                        "type": "custmText",
                        "similarity": 0.32,
                        "content": " Each Party shall inform its customers that during roaming, the storage, treatment and transfer of their personal data may be subject to regulation different from the regulation in their own country. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "12.3",
                        "uuid": "d59508d1-cff2-1b6b-8ac8-6ea5616b8c9b",
                        "type": "custmText",
                        "similarity": 0.7894736842105263,
                        "content": " The Parties confirm that they shall comply with the Data Privacy Regulations/Laws applicable in their respective countries.    1"
                    }
                ]
            },
            {
                "id": "13",
                "article": "Fraud Prevention",
                "uuid": "c560505b-e37a-1c10-b309-5ec21624d1ae",
                "variables": [
                    {
                        "uuid": "3e9534c1-4b95-14d2-b47d-2b67dcf95658",
                        "subarticle": "13.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "f39d0d9f-25b8-1f5f-8de8-de76c30ccfaa",
                        "subarticle": "13.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "13.1",
                        "uuid": "0574fce1-d240-1e64-9a26-c8470b5f8200",
                        "type": "custmText",
                        "similarity": 0.5263157894736842,
                        "content": "The Parties shall comply with the procedures and provisions concerning fraudulent or unauthorised use by Roaming Customers set out in the GSM Association Permanent Reference Documents. The Parties shall implement fraud prevention procedures as specified by the GSM Association Binding PRD BA.20."
                    },
                    {
                        "id": "13.2",
                        "uuid": "7515e7ab-a940-11f6-b437-e78a65102b06",
                        "type": "newText",
                        "similarity": 0,
                        "content": "Are considered as an “acceptable periodical travel presence” on the Proximus network the presence of maximum 15 % of the Roaming- In subscribers of the EU operator for maximum 30 days in a 4 months period and 5% of the Roaming-In subscribers for maximum 90 days in a 4 months period. Notwithstanding any clause to the contrary in any other document, if more than 15% of the Roaming-In subscribers of the EU operator are detected by the Proximus network for more than 30 days in a 4 months period or more than 5% of the Roaming-In subscribers are detected for more than 90 days in a 4 months period, the corresponding usage that exceeds the above mentioned parameters will be considered as a “Suspected fraudulent or unauthorised use” of Proximus network. When this suspected fraudulent or unauthorised use is observed by Proximus, a monthly penalty for voice, SMS messages and data will be invoiced in accordance with the traffic volume generated as specified in annex 9 of the Agreement, without prejudice to Proximus’ right to suspend the service according to clause 15.1 (and notably 15.1.3). Notwithstanding any clause to the contrary, in the event penalties have been invoiced for a total period of six months during a contractual year, Proximus reserves the right to terminate the present Agreement in accordance with the procedure described in Art 3 of the Regulation n°531/2012 amended by Regulation 2017/920 on roaming on public mobile communication networks within the European Union. During this procedure, the penalties remain due (if applicable) Proximus reserves the right to review the parameters indicated in the present regulated offer to define what is considered as an “acceptable periodical travel presence” after having notified the BIPT of the objective grounds based on which Proximus considers that the current parameters are no more appropriate. The present Article 13.2 only applies to EU/EEA traffic.     1"
                    }
                ]
            },
            {
                "id": "14",
                "article": "Liability of the Parties",
                "uuid": "0109ad50-9bd8-1839-a1ba-d9cc115399b8",
                "variables": [
                    {
                        "uuid": "7fba0f3b-4d69-10cb-a676-616505d0537c",
                        "subarticle": "14.1",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "6592464d-e6dd-14a6-b9f0-1ffa1c8c9351",
                        "subarticle": "14.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "14.1",
                        "uuid": "53e4ac1f-c0a9-1e9d-a5fb-d4eaf3d4a7eb",
                        "type": "custmText",
                        "similarity": 0.4083333333333333,
                        "content": "Neither Party shall be liable to the other Party under or in connection with the Agreement except: 1. in respect of charges to be paid to Proximus pursuant to Article 7; This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions 2. to the extent of its negligence where such negligence results in proven damages or loss to the other Party, in which event the liability of the negligent Party shall be limited to and shall in no event exceed two hundred and fifty thousand (250,000) SDR in respect of any one incident or series of incidents arising from the same cause; 3. in respect of charges arising from non-compliance with binding GSM Association Permanent Reference Documents pursuant to Article 13.  "
                    },
                    {
                        "id": "14.2",
                        "uuid": "b3c3ebc8-94f3-1803-9790-d737e36ccd94",
                        "type": "stdClause",
                        "similarity": 0.8888888888888888,
                        "content": "Furthermore, in no event shall either Party be liable for any consequential damage or loss of whatsoever nature, including but not limited to, loss of profit or loss of business, even if such Party has been advised of the possibility of such loss or damage."
                    },
                    {
                        "id": "14.3",
                        "uuid": "42d7cba7-cbef-12b9-8934-4c6c72fb5cf2",
                        "type": "custmText",
                        "similarity": 0.782608695652174,
                        "content": "In no event shall any employee of either Party or of an Affiliated Company be liable to the other Party for any act of negligence or intent under or in connection with the Agreement. Save for the limitations in Articles 14.1 and 14.2 nothing in the foregoing shall in any way restrict the liability of either Party for the actions of its employees."
                    },
                    {
                        "id": "14.4",
                        "uuid": "dd6adeef-f66b-1e5c-9259-a0b8ba170d65",
                        "type": "stdClause",
                        "similarity": 0.8571428571428571,
                        "content": "Limitation of liability as described in this Article shall not apply if damage or loss is caused by a Party's wilful misconduct (including fraud) or gross negligence.  1"
                    }
                ]
            },
            {
                "id": "15",
                "article": "Suspension of Services",
                "uuid": "40425053-bb26-1e7e-aadd-dc804602a6ca",
                "variables": [
                    {
                        "uuid": "d012a0d4-843a-14ff-9cf6-8d5f27c86236",
                        "subarticle": "15.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "ea501940-6ece-1291-b169-3abbd9935f0f",
                        "subarticle": "15.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "54c5e020-0f93-1aff-94a0-dcad01eb4ae2",
                        "subarticle": "15.3",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "da93a4bb-8599-121c-9028-0a6455990df4",
                        "subarticle": "15.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "0a0cadb3-6fe9-1708-a287-e64574621b39",
                        "subarticle": "15.4",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "15.1",
                        "uuid": "8155c40f-d659-12ee-bde3-18c3ad187d48",
                        "type": "custmText",
                        "similarity": 0.5353535353535354,
                        "content": "Notwithstanding anything in the Agreement to the contrary, Proximus may without liability suspend or terminate all or any of its Services to Roaming Customer(s) in circumstances where it would suspend or terminate those Services to its own customers, including but not limited to: 1. Roaming Customers using equipment which is defective or illegal; or 2. Roaming Customers causing any technical or other problems on Proximus’s Public Mobile Network; or 3. Suspected fraudulent or unauthorised use; or 4. Authentication of the legal relationship not being possible; or 5. Traffic volumes which significantly differ from predicted volumes; or 6. Maintenance or enhancement of its Public Mobile Network; or 7. Suspension by non-payment exceeding 3 months."
                    },
                    {
                        "id": "15.2",
                        "uuid": "4d0e2853-f1e1-1649-8900-c286a15df6e8",
                        "type": "custmText",
                        "similarity": 0.7627118644067796,
                        "content": "In case of a proposed suspension of Services to all Roaming Customers, Proximus shall use commercially reasonable efforts to give four (4) weeks written notice (shorter notice may apply given the circumstances related to the suspension) to Operator prior to the suspension taking effect.  If the suspension continues for more than six (6) months, Operator shall have the right to terminate the Agreement with immediate effect by written notice."
                    },
                    {
                        "id": "15.3",
                        "uuid": "801ee6a7-2887-1592-a7f1-6ce371133066",
                        "type": "custmText",
                        "similarity": 0.38461538461538464,
                        "content": "Operator has the right at any time, for technical reasons, without liability but upon detailed written notice to Proximus, to suspend access to the Services to its Roaming Customers. Alternatively, if it is technically more practicable, Operator may require Proximus to suspend all of its Services to Roaming Customers of Operator. Proximus shall use commercially reasonable efforts to comply with such requirement within seven (7) calendar days after receipt of the said notice. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "15.4",
                        "uuid": "ed856e63-a96e-14a4-ac70-56e226eee6a1",
                        "type": "custmText",
                        "similarity": 0.625,
                        "content": "The Parties agree that the suspension described in Article 15.3 shall be removed as soon as the technical reason for the suspension has been overcome by Proximus or Operator as the case may be.    1"
                    }
                ]
            },
            {
                "id": "16",
                "article": "Force Majeure",
                "uuid": "413e4cc1-c7ab-1e46-806b-cd029ebd66c7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "16.1",
                        "uuid": "baacab53-a6f9-1e82-b709-0d4b312bd8f1",
                        "type": "custmText",
                        "similarity": 0.7413793103448276,
                        "content": "Non-performance of either Party’s obligations pursuant to the Agreement or delay in performing same (except with respect to the payment of charges applicable hereunder) shall not constitute a breach of the Agreement if, and for as long as, it is due to a force majeure event, including, but not being limited to, governmental action, or requirement of regulatory authority, lockouts, strikes, shortage of transportation, war, rebellion or other military action, fire, flood, natural catastrophes, or any other unforeseeable obstacles that a Party is not able to overcome with reasonable efforts, or non-performance of obligations by a sub-contractor to a Party pursuant to any of the aforementioned reasons.  The Party prevented from fulfilling its obligations shall on becoming aware of such event inform the other Party in writing of such force majeure event as soon as possible. If the force majeure event continues for more than six (6) months, either Party shall have the right to terminate the Agreement with immediate effect by written notice."
                    },
                    {
                        "id": "16.2",
                        "uuid": "4e6cb42d-3e14-1767-abde-3f4767d02a9f",
                        "type": "stdClause",
                        "similarity": 0.8113207547169812,
                        "content": "If the affected Party fails to inform the other Party of the occurrence of a force majeure event as set forth in Article 16.1 above, then such Party thereafter shall not be entitled to refer such events to force majeure as a reason for non-fulfilment. This obligation does not apply if the force majeure event is known by both Parties or the affected Party is unable to inform the other Party due to the force majeure event.   1"
                    }
                ]
            },
            {
                "id": "17",
                "article": "Duration of the Agreement",
                "uuid": "21f340f6-f2e5-1814-90fd-ad8cd15b798f",
                "variables": [],
                "subarticles": [
                    {
                        "id": "17.1",
                        "uuid": "47a7d5b8-a720-1ae5-8879-35bba264df52",
                        "type": "newText",
                        "similarity": 0.2898550724637681,
                        "content": "The Agreement comes into force on the Date of the Agreement Without prejudice to the conditions of Articles 15.2, 16.1 and 18, the Agreement shall have a duration of one (1) year as from the Date of the Agreement and shall be subject to tacit yearly renewals unless one of the Parties receives a termination notice 3 months prior to the end of the then current term. The present Article 17.1 is without prejudice to the termination rules as detailed in article 18 below.  1"
                    }
                ]
            },
            {
                "id": "18",
                "article": "Termination of the Agreement",
                "uuid": "8da2fc42-2ed2-117c-b430-eac3114afc0a",
                "variables": [
                    {
                        "uuid": "c4916833-c542-1f36-8ec2-59ae2df10bb8",
                        "subarticle": "18.1",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "70233926-f217-1ff6-928f-8080b137e428",
                        "subarticle": "18.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "1ae3a22d-8ad8-1987-bb7d-9b5e2015c262",
                        "subarticle": "18.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "18.1",
                        "uuid": "9c72f2c3-0f1b-1922-b4ed-79cadffef6c6",
                        "type": "custmText",
                        "similarity": 0.4896907216494845,
                        "content": "In addition to the conditions of Articles 15.2, 16.1 and 17 the Agreement may be terminated as follows: 1. by mutual agreement of the Parties in writing subject to a prior notice of six (6) months; or 2. by one of the Parties, with immediate effect, when the other Party is in material breach of the Agreement and does not or is not capable of remedying such breach within thirty (30) days of receipt of a written notice to such effect; This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions  3. by one of the Parties, with immediate effect, if the other Party becomes bankrupt or insolvent or if that other Party enters into any composition or arrangement with its creditors and that other Party is not able to ensure performance of its obligations under the Agreement by a guarantee from a first class bank, payable on first written demand; 4. by written notice of either Party to the other in the event that IR becomes technically or commercially impracticable on Proximus’s Public Mobile Network and the provisions set out in Article 15 are not sufficient to solve the problem or if an unacceptable level of unauthorized use occurs and the other Party is not capable of remedying such unauthorized use within sixty (60) days of receipt of a written notice to such effect; or 5. subject to Article 14.1 immediately in the event a final order by the relevant governmental authority revoking or denying renewal of the license(s) or permission to operate a Public Mobile Network(s) granted to either Party, or any other license necessary to operate the Service(s), takes effect."
                    },
                    {
                        "id": "18.2",
                        "uuid": "a561c4c0-96a6-1075-a4cb-f503e1ff8eab",
                        "type": "custmText",
                        "similarity": 0.7073170731707317,
                        "content": "In the event of termination on the grounds of a breach of the Agreement under the Article 18.1.2, the Party in breach shall, notwithstanding Article 14.2, be liable to the other Party (in addition to charges properly due and payable to Proximus) for proven direct damage or loss (excluding indirect or consequential damage or loss) arising as a consequence of such breach up to a maximum aggregate liability of two hundred and fifty thousand (250,000) SDR, provided, however, that such limitation of liability shall not apply if a damage or loss is caused by a Party’s wilful misconduct or gross negligence.  1"
                    }
                ]
            },
            {
                "id": "19",
                "article": "Changes to the Agreement",
                "uuid": "631476fe-1a20-13b2-9ded-08c5244c16a7",
                "variables": [
                    {
                        "uuid": "c69e2738-38c1-1178-9362-d20cd3669dac",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "8703b44a-bfdb-109b-b005-bdc49e168d76",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "5686af0d-78e3-181d-976d-2dc9f88743e0",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "57535dfa-7949-16aa-b6f9-d00d008c5483",
                        "subarticle": "19.3",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "19.1",
                        "uuid": "def0563d-901b-11f3-9247-736e3dea6d16",
                        "type": "custmText",
                        "similarity": 0.7419354838709677,
                        "content": "Any amendments and/or additions to the Agreement and/or Annexes and/or Addenda shall be valid only if made in writing and signed by duly authorized representatives of both Parties hereto."
                    },
                    {
                        "id": "19.2",
                        "uuid": "8b9a090a-5a4d-1ae9-b464-b1de523c9f9f",
                        "type": "custmText",
                        "similarity": 0.41397849462365593,
                        "content": "Notwithstanding Article 19.1 Proximus shall be entitled to:  1. implement new Services or change existing Services as it sees fit subject to the successful completion of all network and billing test procedures as set out in the Technical Specifications and the GSM Association Permanent Reference Documents and as requested by either Party. Proximus shall give Operator at least thirty (30) days’ prior written notice of any implementation of Services for the first time. Proximus also agrees to use its reasonable efforts to give the other Party at least thirty (30) days prior written notice of any other proposed implementation of new Services or change of existing Services which is a major change which has an impact on IR;   2. terminate all or any existing Services offered by or to a roaming partner. Proximus agrees to use its reasonable efforts to give Operator at least sixty (60) days prior written notice of any termination of existing Services which is a major change which has an impact on IR; or  3. subject to the constraints of the Roaming Regulation, vary its tariff stated in the Annex 8 or subsequent variation thereof. In the case of scheduled This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions  changes (as described in BA.27) Proximus shall give sixty (60) days written notice of any variation to its tariff and the new change shall take effect on the first day of the month following the expiration of the sixty (60) day notice period. In the case of unscheduled changes Proximus shall use all reasonable endeavours to give adequate notice of such changes and the new change shall take effect on the first day following the expiration of the notice period given. Any variation in the tariff shall be deemed to be incorporated into the Agreement. Any challenges to changes to the Tariff shall be made in accordance with Article 23.22.2;  "
                    },
                    {
                        "id": "19.3",
                        "uuid": "51a23ff4-49dc-1e3a-a4e3-13229af260f9",
                        "type": "custmText",
                        "similarity": 0.7301587301587301,
                        "content": "The references to Technical Specifications and binding GSM Association Permanent Reference Documents in Article 5.1 (1) and (2) shall be deemed to include references to these documents as amended by GSM Association from time to time.  However the reference to non-binding GSM Association Permanent Reference Documents in Article 5.1(3) shall not be deemed to include a reference to such non-binding documents as amended by GSM Association from time to time unless and to the extent that this is expressly agreed by the Parties and detailed in the Agreement, including the Annexes. This Article 19.23 shall be subject to Article 5.2.  "
                    },
                    {
                        "id": "19.4",
                        "uuid": "b5acb0e1-148e-1a92-861f-b4fc8d59458e",
                        "type": "custmText",
                        "similarity": 0.7916666666666666,
                        "content": "It is also recognised by the Parties that it may be appropriate to seek changes to the Agreement in the light of experience and development in the GSM Association and the establishment of IR between the Parties. Accordingly, the Parties shall enter into good faith discussions with a view to agreeing mutually acceptable modifications to the Agreement.  2"
                    }
                ]
            },
            {
                "id": "20",
                "article": "Miscellaneous",
                "uuid": "0436d3ff-5aa2-10cc-b184-b44910b0fc17",
                "variables": [
                    {
                        "uuid": "8df71d3e-6714-1458-aafc-5f3df2275c19",
                        "subarticle": "20.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "8e4b524e-cf4f-11f8-a36b-03b72830ee2b",
                        "subarticle": "20.3",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "3021b17e-0674-1a34-948f-086d781d2baf",
                        "subarticle": "20.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "20.1",
                        "uuid": "92220be8-e6f2-119a-b30f-711dfc5645f6",
                        "type": "custmText",
                        "similarity": 0.5148514851485149,
                        "content": "Successors and Assigns The Agreement and the rights and obligations specified herein shall be binding upon the Parties hereto and their respective legal successors and neither Party shall sell, transfer or assign the Agreement or any part, interest, right or obligation hereunder, except that a Party shall have the right to transfer or assign the Agreement in whole (but not in part) to an Affiliated Company who is also a Member of the GSM Association or to an assignee of its license or right to operate a Public Mobile Network(s) provided that such assignee expressly assumes, by written instrument approved by the Parties, all of the obligations of such Party hereunder and thereby becomes a Party hereunder, it being understood that such assignment shall not release the assigning Party of its obligations under Article 11 of this Agreement.  No person other than a Party to the Agreement shall acquire any rights hereunder as a third-party beneficiary or otherwise by virtue of the Agreement.   "
                    },
                    {
                        "id": "20.2",
                        "uuid": "8b5e5fc6-cde7-1d67-b291-1c7755ca685a",
                        "type": "custmText",
                        "similarity": 0.7307692307692307,
                        "content": "Headings The headings of the Agreement are for the convenience of reference only and shall in no way limit or affect the meaning or interpretation of the provisions of the Agreement."
                    },
                    {
                        "id": "20.3",
                        "uuid": "7ca590d8-b70e-1dea-acd1-5c63f6f20645",
                        "type": "custmText",
                        "similarity": 0.4,
                        "content": "No waiver This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions Failure by any Party at any time or times to require performance of any provisions of the Agreement shall in no manner affect its rights to enforce the same, and the waiver by any Party of any breach of any provisions of the Agreement shall not be construed to be a waiver by such Party of any succeeding breach of such provision or waiver by such Party of any breach of any other provision hereof.      "
                    },
                    {
                        "id": "20.4",
                        "uuid": "a742b9b4-f0b9-1b3d-9098-eed7bd60c234",
                        "type": "custmText",
                        "similarity": 0.7222222222222222,
                        "content": "Provisions severable If any part of the Agreement or any Annex hereto is held to be invalid or unenforceable, such determination shall not invaliDate any other provision of the Agreement or Annexes hereto; and the Parties shall attempt, through negotiations in good faith, to replace any part of the Agreement or Annexes hereto so held to be invalid or unenforceable.  The failure of the Parties to agree on such replacement shall not affect the validity of the remaining parts of the Agreement."
                    },
                    {
                        "id": "20.5",
                        "uuid": "468be5ea-2835-1283-94b1-b98a3764962a",
                        "type": "custmText",
                        "similarity": 0.7727272727272727,
                        "content": "Notices All notices, information and communications required under the Agreement shall be given as described in Annex 1: Agreement Management Principles."
                    },
                    {
                        "id": "20.6",
                        "uuid": "1d653904-611c-1c01-be94-d2c9c4efc12a",
                        "type": "custmText",
                        "similarity": 0.7727272727272727,
                        "content": "Compliance with Laws and Regulatory requirements  The commitment of the Parties hereto shall be subject to all applicable laws and/or regulatory requirements, present and future, of any governmental or regulatory authority having jurisdiction over the Parties hereto, as well as any valid order of a court of competent jurisdiction."
                    },
                    {
                        "id": "20.7",
                        "uuid": "4b56db86-f9f2-1859-8ab2-b377f840bcf9",
                        "type": "custmText",
                        "similarity": 0.696969696969697,
                        "content": "Anti-bribery compliance The Parties hereby acknowledge the importance of combating and preventing bribery and to that end both Parties agree to comply fully with all applicable laws, regulations and sanctions relating to anti-bribery and anti-corruption.  2"
                    }
                ]
            },
            {
                "id": "21",
                "article": "Choice of Law",
                "uuid": "1bb4c3b4-b7b9-1505-a274-1cc2e07b65d7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "21.1",
                        "uuid": "1222e631-87a6-111e-8249-87b03a2e1a6a",
                        "type": "newText",
                        "similarity": 0.10810810810810811,
                        "content": "The Agreement and any matters relating hereto shall be governed by and construed in accordance with Swiss law.  2"
                    }
                ]
            }
        ]
    },
    {
        "uid": "2",
        "type": "text",
        "verify": "Document Name",
        "hint": "RA002",
        "articles": [
            {
                "id": "1",
                "article": "Introduction and scope2",
                "uuid": "9743f31c-ec13-16fa-b99c-2409c32b346e",
                "variables": [
                    {
                        "uuid": "e6bf136b-a3c9-1895-8d98-8a319b708333",
                        "subarticle": "1.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "8dba4b09-cce7-15f7-b6ea-11c68da73947",
                        "subarticle": "1.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "aa0c41dd-78db-13d1-be5c-0e0366ee0640",
                        "subarticle": "1.4",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "bfd09dba-8e81-16d2-9855-446febf49971",
                        "subarticle": "1.6",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "608f9b7f-7594-1e7e-99bd-1af6656e7712",
                        "subarticle": "1.8",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "b11698e7-16b9-1fcf-ae98-53c14bb9fa4e",
                        "subarticle": "1.8",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "1.1",
                        "uuid": "9ff284ae-908a-1e80-8831-90a4cef427a5",
                        "type": "custmText",
                        "similarity": 0.7380952380952381,
                        "content": "This a unilateral agreement for International Roaming for the provision by Proximus of Direct Wholesale Roaming Access Services, in order to enable Roaming Customers of Operator to gain access to mobile telecommunications services in the geographic areas where Proximus operates as a VPMN. This agreement is for Direct Roaming Wholesale Access (“agreement”), as defined below.  "
                    },
                    {
                        "id": "1.2",
                        "uuid": "bdbdac41-4cdf-190b-bd3f-8d4b4bea7e04",
                        "type": "newText",
                        "similarity": 0.13414634146341464,
                        "content": "The Operator is either (i) a MNO constituting a Roaming Provider or (ii) a full MVNO which operates as an MNO in relation to international roaming and which equally constitutes a Roaming Provider.  This reference offer is intended for EU/EEA MNO’s and full MVNO’s having obtained a License and/or Authorization for offering mobile services by the authorities in their EU/EEA country of origin, excluding Belgium."
                    },
                    {
                        "id": "1.3",
                        "uuid": "83732a00-0ebf-12aa-bab2-89a4c59c14ab",
                        "type": "custmText",
                        "similarity": 0.3333333333333333,
                        "content": "This Direct Wholesale Roaming Access Agreement contains the basic principles applicable to the Services provided by Proximus to Operator."
                    },
                    {
                        "id": "1.4",
                        "uuid": "07a1a24b-33b3-1968-b9c2-61f640ae2e28",
                        "type": "newText",
                        "similarity": 0.06666666666666667,
                        "content": "The Services and the technical terms and conditions offered by Proximus to Operator shall not differ substantially from those provided by Proximus to other Operators who request a similar service upon similar technical, qualitative and pricing conditions, however subject to technical availability. Without prejudice to the foregoing, the Parties may alternatively directly amend the terms and conditions of this Agreement, or otherwise include deviations.  "
                    },
                    {
                        "id": "1.5",
                        "uuid": "605412b5-ef8d-1b6e-bee3-f6e67da6f082",
                        "type": "newText",
                        "similarity": 0.16,
                        "content": "The Annexes, including the Overview of the Annex Structure, constitute an integral part of the Agreement. In case of discrepancy between different parts of the Agreement the following order of interpretation shall be applied:  1. the main body of this Agreement; and  2. the Annexes "
                    },
                    {
                        "id": "1.6",
                        "uuid": "81805e95-4b6e-1d32-bce9-4768938d9131",
                        "type": "newText",
                        "similarity": 0.05172413793103448,
                        "content": "In case of additional requirements, exceptions and/or contradictions between the Agreement and any Technical Specifications or GSM Association Permanent Reference Documents, the provisions of the Agreement shall prevail."
                    },
                    {
                        "id": "1.7",
                        "uuid": "7ed277db-44db-1ed8-98f8-fb101b2f73ab",
                        "type": "newText",
                        "similarity": 0.10204081632653061,
                        "content": "Subject to applicable laws, the Parties agree to be bound by GSMA Permanent Reference documents relevant to International Roaming for example but not limited to: 1. GSMA PRDs related to Quality of Service; 2. GSMA PRDs related to Fraud Detection; and 3. GSMA PRDs relating to Billing between the parties including Invoicing, Settlement and dispute resolution."
                    },
                    {
                        "id": "1.8",
                        "uuid": "bf955807-3204-1340-bc2e-69d2b0087905",
                        "type": "newText",
                        "similarity": 0.13953488372093023,
                        "content": "he conclusion of the Agreement is subject to the respect of the procedure for access requests, as described on Proximus website.  Moreover, as a condition precedent for the signature of the present Agreement, such Agreement may not be signed (or renewed) if during the 12 months preceding the envisaged Date of signature/renewal, the Operator has been subject to a notice of termination sent by Proximus in the context of Direct Wholesale Roaming Access services or to penalties for abusive use of the then ongoing Wholesale Roaming Access Agreement. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions   "
                    }
                ]
            },
            {
                "id": "2",
                "article": "Starting Date2",
                "uuid": "41da7c4d-ff32-1a52-89b7-49f27bfb8683",
                "variables": [],
                "subarticles": [
                    {
                        "id": "2.1",
                        "uuid": "69cd2ae8-da6b-1297-9b4c-9575caf23ac6",
                        "type": "custmText",
                        "similarity": 0.7428571428571429,
                        "content": "The actual commercial starting Date for International Roaming shall be the Date as agreed by both Parties in written form after successful completion of all necessary network and billing test procedures.  "
                    }
                ]
            },
            {
                "id": "3",
                "article": "Definitions",
                "uuid": "115500d1-e48e-1d19-9482-be7a9ef909e9",
                "variables": [
                    {
                        "uuid": "7fcc9457-6842-123d-bb7d-c6b24115f8ca",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "c00d01ce-78ac-145d-897c-e2610bcce4fa",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "e333b23d-172e-1ecf-8bb2-16b170d9b3bf",
                        "subarticle": "3.7",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "51c30fd1-0d97-18f5-811d-2696ad64de1e",
                        "subarticle": "3.9",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "bdb31500-22a7-16b1-9422-29b743239c7f",
                        "subarticle": "3.9",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "2d2fdc00-1b21-1182-86ce-5012e83da2dc",
                        "subarticle": "3.12",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "3.1",
                        "uuid": "c7ea55d4-e2cc-1100-961c-62fe5ae47574",
                        "type": "custmText",
                        "similarity": 0.7142857142857143,
                        "content": " \"Affiliated Company\" of a Party means any other legal entity: 1. directly or indirectly owning or controlling the Party, or 2. under the direct or indirect ownership or control of the same legal entity directly or indirectly owning or controlling the Party, or 3. directly or indirectly owned or controlled by the Party, for so long as such ownership or control lasts.  Ownership or control shall exist through the direct or indirect ownership of more than 50 % of the nominal value of the issued equity share capital or of more than 50 % of the shares entitling the holders to vote for the election of directors or persons performing similar functions."
                    },
                    {
                        "id": "3.2",
                        "uuid": "8ea3e706-a680-1722-b28b-f674ff65c179",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.3",
                        "uuid": "2cb55636-563b-1419-b203-138d3c2587ff",
                        "type": "custmText",
                        "similarity": 0.5483870967741935,
                        "content": "\"Agreement\" shall mean this Direct Wholesale Roaming Access Agreement together with the Annexes attached hereto. \"Date of the Agreement\" shall mean the Date as of which both Parties have signed the Agreement by their duly authorized representatives."
                    },
                    {
                        "id": "3.4",
                        "uuid": "b8230d05-fe09-1745-a22e-27ab2fa55fd0",
                        "type": "newText",
                        "similarity": 0.11764705882352941,
                        "content": "Direct Wholesale Roaming Access shall have the meaning as defined in Article 2 (2) (p) of the Roaming Regulation, with the exception of wholesale roaming resale access as defined in Article 2 (2) (q) of the Roaming Regulation."
                    },
                    {
                        "id": "3.5",
                        "uuid": "b8f11fe0-bb84-1a3a-8d47-a2d672680465",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.6",
                        "uuid": "356a1d49-46a4-11de-81b0-58d44486a539",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.7",
                        "uuid": "1ff2b850-6001-1df5-a07e-63810b176c15",
                        "type": "newText",
                        "similarity": 0.11428571428571428,
                        "content": "\"GSM Association General Assembly\" shall mean that body of the GSM Association formed by the Members and Associate Members. \"GSM Association Permanent Reference Documents\" means a document noted as such by the PSMC to the General Assembly and listed as such by Headquarters on the list of Permanent Reference Documents. “International Roaming” or “IR” shall mean the provision of Services by Proximus in respect of which access is granted by Roaming Customers of Operator through Proximus’ s PMN. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "3.8",
                        "uuid": "f7886820-b774-1c6b-96ad-1f272463dab4",
                        "type": "newText",
                        "similarity": 0.0,
                        "content": ""
                    },
                    {
                        "id": "3.9",
                        "uuid": "f9841ed7-9a57-187b-b4e3-c6e8cda6fe96",
                        "type": "newText",
                        "similarity": 0.07692307692307693,
                        "content": "\"Public Mobile Network“ or \"PMN\" shall mean a network that complies with the definition of a GSM network as set out in the Articles of Association of the GSM Association (AA.16).1  \"Roaming Customer\" shall have the meaning as defined in Article 2 (2) (g) of the Roaming Regulation and shall in practice mean a person or entity with a valid legal relationship with Operator using a GSM SIM (Subscriber Identity Module) and/or a GSM USIM (Universal Subscriber Identity Module) for use by that person or entity of the Services while roaming on Proximus’s PMN in accordance with this Agreement. terms and conditions of the "
                    },
                    {
                        "id": "3.10",
                        "uuid": "404b85d1-8688-107c-957f-d35709aefef3",
                        "type": "newText",
                        "similarity": 0.08,
                        "content": " Roaming Provider shall have the meaning as defined in Article 2 (2) (a) of the Roaming Regulation."
                    },
                    {
                        "id": "3.11",
                        "uuid": "c373ecd3-602b-169f-9e43-f0f9b84803bc",
                        "type": "newText",
                        "similarity": 0.06818181818181818,
                        "content": " Roaming Regulation shall mean the Regulation (EU) No. 2015/2120 of the European Parliament and of the Council of 25 November 2015 amending Regulation (EU) No 531/2012 on roaming on public mobile communications networks within the Union, O.J., L 310/1 of 26 November 2015."
                    },
                    {
                        "id": "3.12",
                        "uuid": "77dca38c-800d-1414-9e9d-0b34f071b80a",
                        "type": "newText",
                        "similarity": 0.1111111111111111,
                        "content": " \"Services\" shall mean the services of Direct Wholesale Roaming Access provided under this Agreement, as specified in Annexes 2 and 10, as the same may be amended from time to time by Proximus."
                    },
                    {
                        "id": "3.13",
                        "uuid": "becabde2-bacb-1f03-a864-89bd26415af7",
                        "type": "newText",
                        "similarity": 0.03225806451612903,
                        "content": " “Session” shall mean the time between PDP Context Activation until PDP Context deactivation."
                    }
                ]
            },
            {
                "id": "4",
                "article": "Annexes",
                "uuid": "870288fc-8766-1f1d-8fcc-432b18649b85",
                "variables": [],
                "subarticles": [
                    {
                        "id": "4.1",
                        "uuid": "c37def81-6547-175c-9105-f44be2ace8a8",
                        "type": "stdClause",
                        "similarity": 1.0,
                        "content": " The Annexes are divided as set out in the Overview of the Annex Structure.       "
                    }
                ]
            },
            {
                "id": "5",
                "article": "Technical Framework",
                "uuid": "229c98f4-d180-1176-a913-ccebb54a62a0",
                "variables": [
                    {
                        "uuid": "05a0f1cf-2562-1b20-99a7-94988ec42cc5",
                        "subarticle": "5.2",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "5.1",
                        "uuid": "9d38fc1b-30c4-1001-afc7-3cddf76c4c96",
                        "type": "newText",
                        "similarity": 0.2638888888888889,
                        "content": "In respect of and subject to their licenses or rights and other national binding regulations to establish and operate Public Mobile Networks, the Parties to the Agreement agree, subject to Article "
                    },
                    {
                        "id": "5.2",
                        "uuid": "d042ff71-92e1-1dba-a165-0cea5696d85c",
                        "type": "custmText",
                        "similarity": 0.3508771929824561,
                        "content": "to establish IR in accordance with: 1. relevant Technical Specifications;  2. all binding GSM Association Permanent Reference Documents; and  3. those non-binding GSM Association Permanent Reference Documents which are agreed by the Parties and specifically set out in the Annexes; including in each case all the commercial aspects, as defined in the Agreement, including the Annexes hereto. 5.2. Additional requirements and exceptions to the Technical Specifications and GSM Association Permanent Reference Documents, as agreed between the Parties, are detailed in the Agreement and/or Annexes to the Agreement.   "
                    }
                ]
            },
            {
                "id": "6",
                "article": "Management of Modifications to the Services",
                "uuid": "aede5ed9-9bca-1ac8-a951-dd00042dbab2",
                "variables": [
                    {
                        "uuid": "a2aea036-1654-1d0f-84ed-68cadd1975e8",
                        "subarticle": "6.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "63e6c314-f971-1560-925c-7c4f75ef8fac",
                        "subarticle": "6.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "f605d2f3-14e8-1130-88a5-18f3d98713ab",
                        "subarticle": "6.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "ca6a003f-976f-1924-93c4-b9dad16368a2",
                        "subarticle": "6.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "6.1",
                        "uuid": "2d5cbef2-b3cf-1639-b688-6d88ad2a8ad0",
                        "type": "custmText",
                        "similarity": 0.6049382716049383,
                        "content": "Following notice of change served by Proximus to implement new Services or changes to any existing Services in accordance with Article 19.2, section 2 both Parties shall discuss the impact of any such change for Roaming Customers (including Roaming Customers’ access to these Services) and in relation to:  1. network and billing test procedures as set out in the Technical Specifications and the GSM Association Permanent Reference Documents, as requested by either Party;  2. administrative activities; and 3. the targeted starting Date for the changed services."
                    },
                    {
                        "id": "6.2",
                        "uuid": "75281aba-aed8-1703-b7d5-4bbe1153d875",
                        "type": "newText",
                        "similarity": 0,
                        "content": "he Roaming provider is entitled to ask the Direct Wholesale Operator, prior to the launch, a forecast of all voice, SMS and data traffic for the coming 12 months after commercial launch. These forecasts will enable Proximus to make the Services available in the best possible conditions. Consequently, such forecasts shall be based on reliable data and Operator undertakes to upDate them at the end of each calendar semester starting from the semester following the commercial starting Date, by consistently maintaining a 12-month anticipation. In case of inaccurate forecasts, Proximus will not be liable for any default in the provision of the Services.  This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    }
                ]
            },
            {
                "id": "7",
                "article": "Charging, Billing & Accounting",
                "uuid": "4a64749a-162c-1ea3-86f8-f23be9de62e8",
                "variables": [
                    {
                        "uuid": "40499249-e60e-100b-ab4d-fb609632a9f8",
                        "subarticle": "7.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "7.1",
                        "uuid": "491be861-5517-1d55-8eed-e974fe3764e3",
                        "type": "newText",
                        "similarity": 0.07017543859649122,
                        "content": "When a Roaming Customer uses the Services made available hereunder by Proximus, Operator shall be responsible for payment of charges for the said Services so used in accordance with the tariff of Proximus.  "
                    },
                    {
                        "id": "7.2",
                        "uuid": "0720ed13-fb93-1561-b747-fd8171306164",
                        "type": "newText",
                        "similarity": 0.09090909090909091,
                        "content": "he Roaming provider is entitled to ask the Wholesale Operator, prior to the commercial launch, to provide a bank guarantee based on the traffic forecast for the coming twelve months. If traffic volumes change the roaming provider may request the bank guarantee to be changed accordingly.    "
                    }
                ]
            },
            {
                "id": "8",
                "article": "Implementation of TAP",
                "uuid": "e1c0b5fc-43a7-14b0-8a3a-75e3dfcecb26",
                "variables": [
                    {
                        "uuid": "fda5ac2b-02a1-13ba-ab59-5e4fa72625f4",
                        "subarticle": "8.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "8.1",
                        "uuid": "663f3483-a98c-1511-83cd-efdedbba6c85",
                        "type": "stdClause",
                        "similarity": 0.8571428571428571,
                        "content": "The Parties shall implement TAP according to the GSM Association Permanent Reference Documents and the provisions set out in the Annex 3.1.  "
                    }
                ]
            },
            {
                "id": "9",
                "article": "Billing and Accounting",
                "uuid": "1c64317c-b387-138e-9947-e122a3fb8f08",
                "variables": [],
                "subarticles": [
                    {
                        "id": "9.1",
                        "uuid": "538c1532-26e0-197d-8e97-75b75fc027db",
                        "type": "custmText",
                        "similarity": 0.75,
                        "content": "The Parties shall implement billing and accounting according to the GSM Association Permanent Reference Documents and the provisions set out in Annex 3.  1"
                    }
                ]
            },
            {
                "id": "10",
                "article": "Customer Care",
                "uuid": "37520720-67fa-1077-ad4b-86d4a9573ff7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "10.1",
                        "uuid": "f07fe540-4d0e-1c4a-9fe5-300937fb9bed",
                        "type": "custmText",
                        "similarity": 0.7333333333333333,
                        "content": "The responsibilities of each Party concerning Customer Care are described in Annex 4.  1"
                    }
                ]
            },
            {
                "id": "11",
                "article": "Confidentiality",
                "uuid": "f4de4338-4c67-1227-be98-5c0cbed080c9",
                "variables": [
                    {
                        "uuid": "f0e32ecf-6755-10b0-8e03-8d12d505a9b1",
                        "subarticle": "11.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "cb088108-f110-1432-a361-6cc9b8000e1b",
                        "subarticle": "11.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "11.1",
                        "uuid": "09e47bbc-b1a5-10ab-b836-df265bbba3ee",
                        "type": "custmText",
                        "similarity": 0.775,
                        "content": "The Parties agree that all aspects of the contents of the Agreement shall be treated as Information (as defined below) and no information in respect to the content of the Agreement shall be disclosed without the prior written consent of the Parties except as reasonably necessary to implement the Agreement  them referred (hereinafter "
                    },
                    {
                        "id": "11.2",
                        "uuid": "791fd312-5139-1f78-a66a-fdd4afd1cde5",
                        "type": "custmText",
                        "similarity": 0.5728643216080402,
                        "content": "In addition to Article 11.1 hereof, the Parties hereby agree to treat all information exchanged between to as \"Information\") as confidential and agree not to disclose such Information in any manner whatsoever, in whole or in part except as provided in this Article 11. The Parties shall not use any Information other than in connection with the discussions between them and any transactions resulting therefrom, or for the provision of the Services as contemplated herein. The Parties are also entitled to disclose Information to third parties in the context of a possible bona fide acquisition or sale of its operations in support of reasonably related due diligence activities in respect thereof, or for the borrowing of funds or obtaining of insurance, in which case any third parties (including lenders or insurance companies) involved in such activities shall be  obliged to enter into confidentiality agreements which have the equivalent content as this Article 11 before receiving the Information. In addition to the foregoing, the Parties shall also be entitled to share information with Affiliated Companies, directors, This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions agents, professional advisers, contractors, employees or resellers on a need to know basis provided that such Affiliated Companies, agents, contractors, employees or resellers have entered into confidentiality agreements in a form substantially equivalent to and on terms and conditions no less stringent than the terms and conditions set out in this Article 11. Subject to Article "
                    },
                    {
                        "id": "11.3",
                        "uuid": "68651b87-c765-1f28-bc2c-2c7277b49d91",
                        "type": "custmText",
                        "similarity": 0.6111111111111112,
                        "content": "each Party shall be liable in accordance with Article 14 (subject to Article 11.3) towards the other Party in respect of any unauthorized disclosure of Information made by any other authorized recipients.  11.3. Notwithstanding Article 14, each Party shall be liable under this Agreement to the other Party in respect of any proven damage or loss to the other Party caused by its unauthorised use or disclosure of such information only up to the sum of five hundred thousand (500,000) SDR.  "
                    },
                    {
                        "id": "11.4",
                        "uuid": "15b5bb61-7285-1123-a02c-5c9a49ba13aa",
                        "type": "custmText",
                        "similarity": 0.7857142857142857,
                        "content": "Notwithstanding Article 11.1 above, Information and the contents of this Agreement may be transmitted to governmental, judicial or regulatory authorities, as may be required by any governmental, judicial or regulatory authority."
                    },
                    {
                        "id": "11.5",
                        "uuid": "0a637b0f-a4df-164f-a375-d384e6b326f3",
                        "type": "custmText",
                        "similarity": 0.6521739130434783,
                        "content": " For the purposes of the Agreement, Information and the contents of this Agreement shall not be considered to be confidential if such Information is: 1. in or passed into the public domain other than by breach of this Article; or 2. known to a receiving Party prior to the disclosure by a disclosing Party; or 3. disclosed to a receiving Party without restriction by a third party having 4. the full right to disclose; or independently developed by a receiving Party to whom no disclosure of confidential Information relevant to such Information has been made."
                    },
                    {
                        "id": "11.6",
                        "uuid": "26e12ab0-3a32-1a41-967b-d9db23aba56a",
                        "type": "stdClause",
                        "similarity": 0.803030303030303,
                        "content": "Each Party agrees that in the event of a breach or threatened breach of Article 11, the harm suffered by the other Party would not be compensable by monetary damages alone and, accordingly, in addition to other available legal or equitable remedies, the other Party shall be entitled to apply for an injunction or specific performance with respect to such breach or threatened breach, without proof of actual damages (and without the requirement of posting a bond or other security) and each Party agrees not to plead sufficiency of damages as a defence.  "
                    },
                    {
                        "id": "11.7",
                        "uuid": "ba9a637d-1895-1dd7-abdf-7f224ee6925c",
                        "type": "custmText",
                        "similarity": 0.7272727272727273,
                        "content": "Article 11 shall survive the termination of the Agreement for a period of ten (10) years but shall not in any way limit or restrict a disclosing Party's use of its own confidential Information.  1"
                    }
                ]
            },
            {
                "id": "12",
                "article": "Data Privacy",
                "uuid": "cb409a1b-0ddc-106d-89ab-58a89e66f931",
                "variables": [
                    {
                        "uuid": "e9a42657-c7cf-149f-aadb-3347c1d29fb8",
                        "subarticle": "12.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "d5edb48e-4012-1329-ad54-744d8dc3ad9f",
                        "subarticle": "12.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "12.1",
                        "uuid": "8df65075-65c4-1d2f-b6cb-70cad7e7178e",
                        "type": "stdClause",
                        "similarity": 0.8333333333333334,
                        "content": "Each Party’s obligations hereunder to transfer information to the other Party shall not apply to the extent that a Party is prohibited from doing so by the regulations and laws of its own country applicable to IR and/or data protection.  "
                    },
                    {
                        "id": "12.2",
                        "uuid": "d46129cf-5355-1d4a-ba68-ade229970570",
                        "type": "custmText",
                        "similarity": 0.32,
                        "content": " Each Party shall inform its customers that during roaming, the storage, treatment and transfer of their personal data may be subject to regulation different from the regulation in their own country. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "12.3",
                        "uuid": "d59508d1-cff2-1b6b-8ac8-6ea5616b8c9b",
                        "type": "custmText",
                        "similarity": 0.7894736842105263,
                        "content": " The Parties confirm that they shall comply with the Data Privacy Regulations/Laws applicable in their respective countries.    1"
                    }
                ]
            },
            {
                "id": "13",
                "article": "Fraud Prevention",
                "uuid": "c560505b-e37a-1c10-b309-5ec21624d1ae",
                "variables": [
                    {
                        "uuid": "3e9534c1-4b95-14d2-b47d-2b67dcf95658",
                        "subarticle": "13.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "f39d0d9f-25b8-1f5f-8de8-de76c30ccfaa",
                        "subarticle": "13.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "13.1",
                        "uuid": "0574fce1-d240-1e64-9a26-c8470b5f8200",
                        "type": "custmText",
                        "similarity": 0.5263157894736842,
                        "content": "The Parties shall comply with the procedures and provisions concerning fraudulent or unauthorised use by Roaming Customers set out in the GSM Association Permanent Reference Documents. The Parties shall implement fraud prevention procedures as specified by the GSM Association Binding PRD BA.20."
                    },
                    {
                        "id": "13.2",
                        "uuid": "7515e7ab-a940-11f6-b437-e78a65102b06",
                        "type": "newText",
                        "similarity": 0,
                        "content": "Are considered as an “acceptable periodical travel presence” on the Proximus network the presence of maximum 15 % of the Roaming- In subscribers of the EU operator for maximum 30 days in a 4 months period and 5% of the Roaming-In subscribers for maximum 90 days in a 4 months period. Notwithstanding any clause to the contrary in any other document, if more than 15% of the Roaming-In subscribers of the EU operator are detected by the Proximus network for more than 30 days in a 4 months period or more than 5% of the Roaming-In subscribers are detected for more than 90 days in a 4 months period, the corresponding usage that exceeds the above mentioned parameters will be considered as a “Suspected fraudulent or unauthorised use” of Proximus network. When this suspected fraudulent or unauthorised use is observed by Proximus, a monthly penalty for voice, SMS messages and data will be invoiced in accordance with the traffic volume generated as specified in annex 9 of the Agreement, without prejudice to Proximus’ right to suspend the service according to clause 15.1 (and notably 15.1.3). Notwithstanding any clause to the contrary, in the event penalties have been invoiced for a total period of six months during a contractual year, Proximus reserves the right to terminate the present Agreement in accordance with the procedure described in Art 3 of the Regulation n°531/2012 amended by Regulation 2017/920 on roaming on public mobile communication networks within the European Union. During this procedure, the penalties remain due (if applicable) Proximus reserves the right to review the parameters indicated in the present regulated offer to define what is considered as an “acceptable periodical travel presence” after having notified the BIPT of the objective grounds based on which Proximus considers that the current parameters are no more appropriate. The present Article 13.2 only applies to EU/EEA traffic.     1"
                    }
                ]
            },
            {
                "id": "14",
                "article": "Liability of the Parties",
                "uuid": "0109ad50-9bd8-1839-a1ba-d9cc115399b8",
                "variables": [
                    {
                        "uuid": "7fba0f3b-4d69-10cb-a676-616505d0537c",
                        "subarticle": "14.1",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "6592464d-e6dd-14a6-b9f0-1ffa1c8c9351",
                        "subarticle": "14.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "14.1",
                        "uuid": "53e4ac1f-c0a9-1e9d-a5fb-d4eaf3d4a7eb",
                        "type": "custmText",
                        "similarity": 0.4083333333333333,
                        "content": "Neither Party shall be liable to the other Party under or in connection with the Agreement except: 1. in respect of charges to be paid to Proximus pursuant to Article 7; This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions 2. to the extent of its negligence where such negligence results in proven damages or loss to the other Party, in which event the liability of the negligent Party shall be limited to and shall in no event exceed two hundred and fifty thousand (250,000) SDR in respect of any one incident or series of incidents arising from the same cause; 3. in respect of charges arising from non-compliance with binding GSM Association Permanent Reference Documents pursuant to Article 13.  "
                    },
                    {
                        "id": "14.2",
                        "uuid": "b3c3ebc8-94f3-1803-9790-d737e36ccd94",
                        "type": "stdClause",
                        "similarity": 0.8888888888888888,
                        "content": "Furthermore, in no event shall either Party be liable for any consequential damage or loss of whatsoever nature, including but not limited to, loss of profit or loss of business, even if such Party has been advised of the possibility of such loss or damage."
                    },
                    {
                        "id": "14.3",
                        "uuid": "42d7cba7-cbef-12b9-8934-4c6c72fb5cf2",
                        "type": "custmText",
                        "similarity": 0.782608695652174,
                        "content": "In no event shall any employee of either Party or of an Affiliated Company be liable to the other Party for any act of negligence or intent under or in connection with the Agreement. Save for the limitations in Articles 14.1 and 14.2 nothing in the foregoing shall in any way restrict the liability of either Party for the actions of its employees."
                    },
                    {
                        "id": "14.4",
                        "uuid": "dd6adeef-f66b-1e5c-9259-a0b8ba170d65",
                        "type": "stdClause",
                        "similarity": 0.8571428571428571,
                        "content": "Limitation of liability as described in this Article shall not apply if damage or loss is caused by a Party's wilful misconduct (including fraud) or gross negligence.  1"
                    }
                ]
            },
            {
                "id": "15",
                "article": "Suspension of Services",
                "uuid": "40425053-bb26-1e7e-aadd-dc804602a6ca",
                "variables": [
                    {
                        "uuid": "d012a0d4-843a-14ff-9cf6-8d5f27c86236",
                        "subarticle": "15.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "ea501940-6ece-1291-b169-3abbd9935f0f",
                        "subarticle": "15.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "54c5e020-0f93-1aff-94a0-dcad01eb4ae2",
                        "subarticle": "15.3",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "da93a4bb-8599-121c-9028-0a6455990df4",
                        "subarticle": "15.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "0a0cadb3-6fe9-1708-a287-e64574621b39",
                        "subarticle": "15.4",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "15.1",
                        "uuid": "8155c40f-d659-12ee-bde3-18c3ad187d48",
                        "type": "custmText",
                        "similarity": 0.5353535353535354,
                        "content": "Notwithstanding anything in the Agreement to the contrary, Proximus may without liability suspend or terminate all or any of its Services to Roaming Customer(s) in circumstances where it would suspend or terminate those Services to its own customers, including but not limited to: 1. Roaming Customers using equipment which is defective or illegal; or 2. Roaming Customers causing any technical or other problems on Proximus’s Public Mobile Network; or 3. Suspected fraudulent or unauthorised use; or 4. Authentication of the legal relationship not being possible; or 5. Traffic volumes which significantly differ from predicted volumes; or 6. Maintenance or enhancement of its Public Mobile Network; or 7. Suspension by non-payment exceeding 3 months."
                    },
                    {
                        "id": "15.2",
                        "uuid": "4d0e2853-f1e1-1649-8900-c286a15df6e8",
                        "type": "custmText",
                        "similarity": 0.7627118644067796,
                        "content": "In case of a proposed suspension of Services to all Roaming Customers, Proximus shall use commercially reasonable efforts to give four (4) weeks written notice (shorter notice may apply given the circumstances related to the suspension) to Operator prior to the suspension taking effect.  If the suspension continues for more than six (6) months, Operator shall have the right to terminate the Agreement with immediate effect by written notice."
                    },
                    {
                        "id": "15.3",
                        "uuid": "801ee6a7-2887-1592-a7f1-6ce371133066",
                        "type": "custmText",
                        "similarity": 0.38461538461538464,
                        "content": "Operator has the right at any time, for technical reasons, without liability but upon detailed written notice to Proximus, to suspend access to the Services to its Roaming Customers. Alternatively, if it is technically more practicable, Operator may require Proximus to suspend all of its Services to Roaming Customers of Operator. Proximus shall use commercially reasonable efforts to comply with such requirement within seven (7) calendar days after receipt of the said notice. This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions "
                    },
                    {
                        "id": "15.4",
                        "uuid": "ed856e63-a96e-14a4-ac70-56e226eee6a1",
                        "type": "custmText",
                        "similarity": 0.625,
                        "content": "The Parties agree that the suspension described in Article 15.3 shall be removed as soon as the technical reason for the suspension has been overcome by Proximus or Operator as the case may be.    1"
                    }
                ]
            },
            {
                "id": "16",
                "article": "Force Majeure",
                "uuid": "413e4cc1-c7ab-1e46-806b-cd029ebd66c7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "16.1",
                        "uuid": "baacab53-a6f9-1e82-b709-0d4b312bd8f1",
                        "type": "custmText",
                        "similarity": 0.7413793103448276,
                        "content": "Non-performance of either Party’s obligations pursuant to the Agreement or delay in performing same (except with respect to the payment of charges applicable hereunder) shall not constitute a breach of the Agreement if, and for as long as, it is due to a force majeure event, including, but not being limited to, governmental action, or requirement of regulatory authority, lockouts, strikes, shortage of transportation, war, rebellion or other military action, fire, flood, natural catastrophes, or any other unforeseeable obstacles that a Party is not able to overcome with reasonable efforts, or non-performance of obligations by a sub-contractor to a Party pursuant to any of the aforementioned reasons.  The Party prevented from fulfilling its obligations shall on becoming aware of such event inform the other Party in writing of such force majeure event as soon as possible. If the force majeure event continues for more than six (6) months, either Party shall have the right to terminate the Agreement with immediate effect by written notice."
                    },
                    {
                        "id": "16.2",
                        "uuid": "4e6cb42d-3e14-1767-abde-3f4767d02a9f",
                        "type": "stdClause",
                        "similarity": 0.8113207547169812,
                        "content": "If the affected Party fails to inform the other Party of the occurrence of a force majeure event as set forth in Article 16.1 above, then such Party thereafter shall not be entitled to refer such events to force majeure as a reason for non-fulfilment. This obligation does not apply if the force majeure event is known by both Parties or the affected Party is unable to inform the other Party due to the force majeure event.   1"
                    }
                ]
            },
            {
                "id": "17",
                "article": "Duration of the Agreement",
                "uuid": "21f340f6-f2e5-1814-90fd-ad8cd15b798f",
                "variables": [],
                "subarticles": [
                    {
                        "id": "17.1",
                        "uuid": "47a7d5b8-a720-1ae5-8879-35bba264df52",
                        "type": "newText",
                        "similarity": 0.2898550724637681,
                        "content": "The Agreement comes into force on the Date of the Agreement Without prejudice to the conditions of Articles 15.2, 16.1 and 18, the Agreement shall have a duration of one (1) year as from the Date of the Agreement and shall be subject to tacit yearly renewals unless one of the Parties receives a termination notice 3 months prior to the end of the then current term. The present Article 17.1 is without prejudice to the termination rules as detailed in article 18 below.  1"
                    }
                ]
            },
            {
                "id": "18",
                "article": "Termination of the Agreement",
                "uuid": "8da2fc42-2ed2-117c-b430-eac3114afc0a",
                "variables": [
                    {
                        "uuid": "c4916833-c542-1f36-8ec2-59ae2df10bb8",
                        "subarticle": "18.1",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "70233926-f217-1ff6-928f-8080b137e428",
                        "subarticle": "18.1",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "1ae3a22d-8ad8-1987-bb7d-9b5e2015c262",
                        "subarticle": "18.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "18.1",
                        "uuid": "9c72f2c3-0f1b-1922-b4ed-79cadffef6c6",
                        "type": "custmText",
                        "similarity": 0.4896907216494845,
                        "content": "In addition to the conditions of Articles 15.2, 16.1 and 17 the Agreement may be terminated as follows: 1. by mutual agreement of the Parties in writing subject to a prior notice of six (6) months; or 2. by one of the Parties, with immediate effect, when the other Party is in material breach of the Agreement and does not or is not capable of remedying such breach within thirty (30) days of receipt of a written notice to such effect; This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions  3. by one of the Parties, with immediate effect, if the other Party becomes bankrupt or insolvent or if that other Party enters into any composition or arrangement with its creditors and that other Party is not able to ensure performance of its obligations under the Agreement by a guarantee from a first class bank, payable on first written demand; 4. by written notice of either Party to the other in the event that IR becomes technically or commercially impracticable on Proximus’s Public Mobile Network and the provisions set out in Article 15 are not sufficient to solve the problem or if an unacceptable level of unauthorized use occurs and the other Party is not capable of remedying such unauthorized use within sixty (60) days of receipt of a written notice to such effect; or 5. subject to Article 14.1 immediately in the event a final order by the relevant governmental authority revoking or denying renewal of the license(s) or permission to operate a Public Mobile Network(s) granted to either Party, or any other license necessary to operate the Service(s), takes effect."
                    },
                    {
                        "id": "18.2",
                        "uuid": "a561c4c0-96a6-1075-a4cb-f503e1ff8eab",
                        "type": "custmText",
                        "similarity": 0.7073170731707317,
                        "content": "In the event of termination on the grounds of a breach of the Agreement under the Article 18.1.2, the Party in breach shall, notwithstanding Article 14.2, be liable to the other Party (in addition to charges properly due and payable to Proximus) for proven direct damage or loss (excluding indirect or consequential damage or loss) arising as a consequence of such breach up to a maximum aggregate liability of two hundred and fifty thousand (250,000) SDR, provided, however, that such limitation of liability shall not apply if a damage or loss is caused by a Party’s wilful misconduct or gross negligence.  1"
                    }
                ]
            },
            {
                "id": "19",
                "article": "Changes to the Agreement",
                "uuid": "631476fe-1a20-13b2-9ded-08c5244c16a7",
                "variables": [
                    {
                        "uuid": "c69e2738-38c1-1178-9362-d20cd3669dac",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "8703b44a-bfdb-109b-b005-bdc49e168d76",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    },
                    {
                        "uuid": "5686af0d-78e3-181d-976d-2dc9f88743e0",
                        "subarticle": "19.2",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "57535dfa-7949-16aa-b6f9-d00d008c5483",
                        "subarticle": "19.3",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    }
                ],
                "subarticles": [
                    {
                        "id": "19.1",
                        "uuid": "def0563d-901b-11f3-9247-736e3dea6d16",
                        "type": "custmText",
                        "similarity": 0.7419354838709677,
                        "content": "Any amendments and/or additions to the Agreement and/or Annexes and/or Addenda shall be valid only if made in writing and signed by duly authorized representatives of both Parties hereto."
                    },
                    {
                        "id": "19.2",
                        "uuid": "8b9a090a-5a4d-1ae9-b464-b1de523c9f9f",
                        "type": "custmText",
                        "similarity": 0.41397849462365593,
                        "content": "Notwithstanding Article 19.1 Proximus shall be entitled to:  1. implement new Services or change existing Services as it sees fit subject to the successful completion of all network and billing test procedures as set out in the Technical Specifications and the GSM Association Permanent Reference Documents and as requested by either Party. Proximus shall give Operator at least thirty (30) days’ prior written notice of any implementation of Services for the first time. Proximus also agrees to use its reasonable efforts to give the other Party at least thirty (30) days prior written notice of any other proposed implementation of new Services or change of existing Services which is a major change which has an impact on IR;   2. terminate all or any existing Services offered by or to a roaming partner. Proximus agrees to use its reasonable efforts to give Operator at least sixty (60) days prior written notice of any termination of existing Services which is a major change which has an impact on IR; or  3. subject to the constraints of the Roaming Regulation, vary its tariff stated in the Annex 8 or subsequent variation thereof. In the case of scheduled This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions  changes (as described in BA.27) Proximus shall give sixty (60) days written notice of any variation to its tariff and the new change shall take effect on the first day of the month following the expiration of the sixty (60) day notice period. In the case of unscheduled changes Proximus shall use all reasonable endeavours to give adequate notice of such changes and the new change shall take effect on the first day following the expiration of the notice period given. Any variation in the tariff shall be deemed to be incorporated into the Agreement. Any challenges to changes to the Tariff shall be made in accordance with Article 23.22.2;  "
                    },
                    {
                        "id": "19.3",
                        "uuid": "51a23ff4-49dc-1e3a-a4e3-13229af260f9",
                        "type": "custmText",
                        "similarity": 0.7301587301587301,
                        "content": "The references to Technical Specifications and binding GSM Association Permanent Reference Documents in Article 5.1 (1) and (2) shall be deemed to include references to these documents as amended by GSM Association from time to time.  However the reference to non-binding GSM Association Permanent Reference Documents in Article 5.1(3) shall not be deemed to include a reference to such non-binding documents as amended by GSM Association from time to time unless and to the extent that this is expressly agreed by the Parties and detailed in the Agreement, including the Annexes. This Article 19.23 shall be subject to Article 5.2.  "
                    },
                    {
                        "id": "19.4",
                        "uuid": "b5acb0e1-148e-1a92-861f-b4fc8d59458e",
                        "type": "custmText",
                        "similarity": 0.7916666666666666,
                        "content": "It is also recognised by the Parties that it may be appropriate to seek changes to the Agreement in the light of experience and development in the GSM Association and the establishment of IR between the Parties. Accordingly, the Parties shall enter into good faith discussions with a view to agreeing mutually acceptable modifications to the Agreement.  2"
                    }
                ]
            },
            {
                "id": "20",
                "article": "Miscellaneous",
                "uuid": "0436d3ff-5aa2-10cc-b184-b44910b0fc17",
                "variables": [
                    {
                        "uuid": "8df71d3e-6714-1458-aafc-5f3df2275c19",
                        "subarticle": "20.1",
                        "type": "text",
                        "verify": "Operator B",
                        "hint": "GSM Association"
                    },
                    {
                        "uuid": "8e4b524e-cf4f-11f8-a36b-03b72830ee2b",
                        "subarticle": "20.3",
                        "type": "text",
                        "verify": "Date",
                        "hint": "29/05/2017"
                    },
                    {
                        "uuid": "3021b17e-0674-1a34-948f-086d781d2baf",
                        "subarticle": "20.3",
                        "type": "text",
                        "verify": "Operator A",
                        "hint": "Proximus"
                    }
                ],
                "subarticles": [
                    {
                        "id": "20.1",
                        "uuid": "92220be8-e6f2-119a-b30f-711dfc5645f6",
                        "type": "custmText",
                        "similarity": 0.5148514851485149,
                        "content": "Successors and Assigns The Agreement and the rights and obligations specified herein shall be binding upon the Parties hereto and their respective legal successors and neither Party shall sell, transfer or assign the Agreement or any part, interest, right or obligation hereunder, except that a Party shall have the right to transfer or assign the Agreement in whole (but not in part) to an Affiliated Company who is also a Member of the GSM Association or to an assignee of its license or right to operate a Public Mobile Network(s) provided that such assignee expressly assumes, by written instrument approved by the Parties, all of the obligations of such Party hereunder and thereby becomes a Party hereunder, it being understood that such assignment shall not release the assigning Party of its obligations under Article 11 of this Agreement.  No person other than a Party to the Agreement shall acquire any rights hereunder as a third-party beneficiary or otherwise by virtue of the Agreement.   "
                    },
                    {
                        "id": "20.2",
                        "uuid": "8b5e5fc6-cde7-1d67-b291-1c7755ca685a",
                        "type": "custmText",
                        "similarity": 0.7307692307692307,
                        "content": "Headings The headings of the Agreement are for the convenience of reference only and shall in no way limit or affect the meaning or interpretation of the provisions of the Agreement."
                    },
                    {
                        "id": "20.3",
                        "uuid": "7ca590d8-b70e-1dea-acd1-5c63f6f20645",
                        "type": "custmText",
                        "similarity": 0.4,
                        "content": "No waiver This reference offer is made pursuant to article 3(5) of Regulation EU/531/2012; it is subject to upDates & completions by Proximus.   This document sets out the main principles; it needs to be completed and if relevant amended on a case by case basis.  Sensitivity: Confidential Proximus reference offer of 29/05/2017  Unilateral Direct Wholesale Roaming Access Agreement : Main terms & conditions Failure by any Party at any time or times to require performance of any provisions of the Agreement shall in no manner affect its rights to enforce the same, and the waiver by any Party of any breach of any provisions of the Agreement shall not be construed to be a waiver by such Party of any succeeding breach of such provision or waiver by such Party of any breach of any other provision hereof.      "
                    },
                    {
                        "id": "20.4",
                        "uuid": "a742b9b4-f0b9-1b3d-9098-eed7bd60c234",
                        "type": "custmText",
                        "similarity": 0.7222222222222222,
                        "content": "Provisions severable If any part of the Agreement or any Annex hereto is held to be invalid or unenforceable, such determination shall not invaliDate any other provision of the Agreement or Annexes hereto; and the Parties shall attempt, through negotiations in good faith, to replace any part of the Agreement or Annexes hereto so held to be invalid or unenforceable.  The failure of the Parties to agree on such replacement shall not affect the validity of the remaining parts of the Agreement."
                    },
                    {
                        "id": "20.5",
                        "uuid": "468be5ea-2835-1283-94b1-b98a3764962a",
                        "type": "custmText",
                        "similarity": 0.7727272727272727,
                        "content": "Notices All notices, information and communications required under the Agreement shall be given as described in Annex 1: Agreement Management Principles."
                    },
                    {
                        "id": "20.6",
                        "uuid": "1d653904-611c-1c01-be94-d2c9c4efc12a",
                        "type": "custmText",
                        "similarity": 0.7727272727272727,
                        "content": "Compliance with Laws and Regulatory requirements  The commitment of the Parties hereto shall be subject to all applicable laws and/or regulatory requirements, present and future, of any governmental or regulatory authority having jurisdiction over the Parties hereto, as well as any valid order of a court of competent jurisdiction."
                    },
                    {
                        "id": "20.7",
                        "uuid": "4b56db86-f9f2-1859-8ab2-b377f840bcf9",
                        "type": "custmText",
                        "similarity": 0.696969696969697,
                        "content": "Anti-bribery compliance The Parties hereby acknowledge the importance of combating and preventing bribery and to that end both Parties agree to comply fully with all applicable laws, regulations and sanctions relating to anti-bribery and anti-corruption.  2"
                    }
                ]
            },
            {
                "id": "21",
                "article": "Choice of Law",
                "uuid": "1bb4c3b4-b7b9-1505-a274-1cc2e07b65d7",
                "variables": [],
                "subarticles": [
                    {
                        "id": "21.1",
                        "uuid": "1222e631-87a6-111e-8249-87b03a2e1a6a",
                        "type": "newText",
                        "similarity": 0.10810810810810811,
                        "content": "The Agreement and any matters relating hereto shall be governed by and construed in accordance with Swiss law.  2"
                    }
                ]
            }
        ]
    }
]